de_alliantie/webservices/woningnet/leegmelden2.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <DeclareEmpty xmlns="http://www.daan.com/ax/woningnet/">
      <Publication>
        <Id>string</Id>
        <Number>string</Number>
        <Sequence>string</Sequence>
        <RealEstateObjectId>string</RealEstateObjectId>
        <AddressStreet>string</AddressStreet>
        <AddressHouseNumber>string</AddressHouseNumber>
        <AddressHouseNumberAddition>string</AddressHouseNumberAddition>
        <AddressZipcode>string</AddressZipcode>
        <AddressCity>string</AddressCity>
        <DistrictId>string</DistrictId>
        <District>string</District>
        <NeighborhoodId>string</NeighborhoodId>
        <Neighborhood>string</Neighborhood>
        <RegistrationTypeId>string</RegistrationTypeId>
        <RegistrationType>string</RegistrationType>
        <HousingId>string</HousingId>
        <Housing>string</Housing>
        <PlotTypeId>string</PlotTypeId>
        <PlotType>string</PlotType>
        <NetRent>string</NetRent>
        <EligibleRent>string</EligibleRent>
        <GrossRent>string</GrossRent>
        <DateEmpty>string</DateEmpty>
        <DateAvailable>string</DateAvailable>
        <Start>string</Start>
        <End>string</End>
        <FloorNo>string</FloorNo>
        <BuiltYear>string</BuiltYear>
        <SellingPrice>string</SellingPrice>
        <PractitionerId>string</PractitionerId>
        <Practitioner>string</Practitioner>
        <PublicationText>string</PublicationText>
        <ObjectGroupId>string</ObjectGroupId>
        <ObjectGroup>string</ObjectGroup>
        <SortField1Id>string</SortField1Id>
        <SortField1>string</SortField1>
        <SortField2Id>string</SortField2Id>
        <SortField2>string</SortField2>
        <SortField3Id>string</SortField3Id>
        <SortField3>string</SortField3>
        <DestinationId>string</DestinationId>
        <Destination>string</Destination>
        <Corporatienummer>string</Corporatienummer>
        <Vestigingsnummer>string</Vestigingsnummer>
      </Publication>
      <Components/>
      <ContractForms/>
      <Attributes/>
      <Criterion/>
      <Pictures/>
    </DeclareEmpty>
  </soap:Body>
</soap:Envelope>
